<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ed79b2e04bc2e8f459a800f9c5dbe0634593263360a2c88dde22128675b763f5","plan_job_ref":"Job Create terraform plan #39 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7201965207","plan_hash":"721b839fec26d5f1ac4637b74cf6d8bec78d97dfa5af7e4f7db8afde34b99a90","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 4 to add, 2 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:950012193416:service/co-boomi-atom-cluster/co-boomi-atom-service"
        name                               = "co-boomi-atom-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:7" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  ~ environment      = [
                        # (1 unchanged element hidden)
                        {
                            name  = "BOOMI_ATOMNAME"
                            value = "coforma-atom-1"
                        },
                      ~ {
                            name  = "BOOMI_ENVIRONMENTID"
                          ~ value = "prod" -> "31363fac-fdde-4c76-ba4d-7f83066a9764"
                        },
                    ]
                  - mountPoints      = []
                    name             = "co-boomi-atom-ct"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 9090
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "*************" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/48203fc170bfe0d164001b1e986827d25f580cf749c839ed81c76cc2c03ee02e.zip" -> "builds/52eccc61b7432d60086bce8a8777f270158dafead409870ca4cc38c5b9bf2851.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-12-12T21:55:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:25/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "25" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/52eccc61b7432d60086bce8a8777f270158dafead409870ca4cc38c5b9bf2851.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/52eccc61b7432d60086bce8a8777f270158dafead409870ca4cc38c5b9bf2851.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/48203fc170bfe0d164001b1e986827d25f580cf749c839ed81c76cc2c03ee02e.zip" -> "builds/52eccc61b7432d60086bce8a8777f270158dafead409870ca4cc38c5b9bf2851.zip"
          ~ "timestamp" = "1702418091685466000" -> "1702507505388923000"
        }
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #39](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7201965207)